app/controllers/corporations_controller.rb

SELECT * FROM "corporations"
---
  def index
    @corporations = Corporation.all

SELECT * FROM "corporations" WHERE ("corporations"."id" = 1)
---
  def show
    @corporation = Corporation.find(params[:id])

INSERT INTO "corporations" ("name", "created_at", "updated_at", "description", "other_info") VALUES('Deloitte', '2010-09-01 23:37:17', '2010-09-01 23:37:17', '', '')
---
  def create
    @corporation = Corporation.new(params[:corporation])
    if @corporation.save

SELECT * FROM "corporations" WHERE ("corporations"."id" = 1)
---
  def edit
    @corporation = Corporation.find(params[:id])

SELECT * FROM "corporations" WHERE ("corporations"."id" = 1)
UPDATE "corporations" SET "updated_at" = '2010-09-02 22:40:34', "description" = 'Sed ut perspiciatis unde omnis iste natus error sit voluptatem accusantium doloremque laudantium, totam rem aperiam, eaque ipsa quae ab illo inventore veritatis et quasi architecto beatae vitae dicta sunt explicabo. Nemo enim ipsam voluptatem quia voluptas sit aspernatur aut odit aut fugit, sed quia consequuntur magni dolores eos qui ratione voluptatem sequi nesciunt. Neque porro quisquam est, qui dolorem ipsum quia dolor sit amet, consectetur, adipisci velit, sed quia non numquam eius modi tempora incidunt ut labore et dolore magnam aliquam quaerat voluptatem. Ut enim ad minima veniam, quis nostrum exercitationem ullam corporis suscipit laboriosam, nisi ut aliquid ex ea commodi consequatur? Quis autem vel eum iure reprehenderit qui in ea voluptate velit esse quam nihil molestiae consequatur, vel illum qui dolorem eum fugiat quo voluptas nulla pariatur?"' WHERE "id" = 1
---
  def update
    @corporation = Corporation.find(params[:id])
    if @corporation.update_attributes(params[:corporation])