app/controllers/mixers_controller.rb

SELECT * FROM "mixers"
---
  def index
    @mixers = Mixer.all

SELECT * FROM "mixers" WHERE ("mixers"."id" = 1)
---
  def show
    @mixer = Mixer.find(params[:id])

INSERT INTO "mixers" ("name", "location", "created_at", "updated_at", "date", "max_number", "description") VALUES('Fall 2010 Corporate Mixer', 'Resnik Cruciform Room', '2010-09-01 23:33:56', '2010-09-01 23:33:56', '2010-09-13 18:00:00', 40, 'we can edit this asdfalkdfja;kdfjdddddddddddddddddddddddddddddddddddddddddddddddddddddddddd
---
  def create
    @mixer = Mixer.new(params[:mixer])
    if @mixer.save