app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT * FROM "students" WHERE (affiliation = 1) ORDER BY created_at

  def show
    @student = Student.find(params[:id])
---
SELECT * FROM "students" WHERE ("students"."id" = 1)

  def create

    @student = Student.new(params[:student])

    if (Student.get_affiliation(@student.affiliation).size >= 20)
      @student.active = false
      PostOffice.deliver_waitlist_msg(@student)

    else
      @student.active = true
      PostOffice.deliver_registration_msg(@student)
    end

    if @student.save
---
SELECT count(*) AS count_all FROM "students" WHERE (affiliation = '1')
INSERT INTO "students" ("created_at", "updated_at", "choice_three", "major", "grad_year", "choice_two", "choice_four", "last_name", "choice_five", "affiliation", "first_name", "email", "active", "choice_one") VALUES('2010-09-04 01:33:24', '2010-09-04 01:33:24', NULL, '9', 2011, NULL, NULL, 'Dockery', NULL, '1', 'Karl', 'k.dockz@gmail.com', 't', NULL)

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
SELECT * FROM "students" WHERE ("students"."id" = 1)
DELETE FROM "students" WHERE "id" = 1